{
  "scraped_at": "2025-01-25T15:45:00",
  "portal": "Native Forward",
  "total_count": 11,
  "scholarships": [
    {
      "title": "BIE Internship Funding for STEM Students 2025-2026",
      "short_description": "Funding assistance for internships related to STEM.",
      "full_description": "Native Forward Scholars Fund, in partnership with the BIE, provides financial assistance to students to participate in internships. This financial assistance is established to offset costs directly associated with participation in approved internships with the Department of Interior (Bureau of Indian Affairs, Bureau of Indian Education, Bureau of Land Management, Bureau of Ocean Energy Management, Bureau of Reclamation, Bureau of Safety and Environmental Enforcement, Bureau of Trust Funds Administration, National Park Service, Office of Surface Mining Reclamation and Enforcement, U.S. Fish and Wildlife Service, U.S. Geological Survey, etc.) or other approved internships directly related to STEM. This award covers travel costs, including the cost to travel to accept the internship, eligible living expenses, and daily commuting costs to travel to and from the internship location. Roundtrip travel, housing, and commuting costs will be considered (documentation for itemized costs must be submitted).",
      "amount": "Not specified",
      "deadline": "February 27, 2026 at 11:59 PM MST",
      "eligibility": "Must be an enrolled member of a federally recognized American Indian Tribe or Alaska Native group OR provide documentation of ancestry to possession of 1/2 degree Indian blood of a federally recognized Tribe. Exclusive consideration will be given to students attending a TCU who are participating in internship opportunities offered by Department of Interior (DOI) agencies. STEM related internships with other organizations will also be considered. Students not attending a TCU will also be considered. Internships must be directly related to STEM. Applicants must find their own internship or training position at an eligible DOI or STEM organization. Submit a letter confirming acceptance from an internship site. Submit receipts for expenses incurred.",
      "application_url": "https://app.smarterselect.com/programs/105560-Native-Forward-Scholars-Fund",
      "status": "Open"
    },
    {
      "title": "BIE Professional Development Funding for STEM Educators and Students 2025-2026",
      "short_description": "Native Forward Scholars Fund provides funding specifically for training opportunities in STEM fields.",
      "full_description": "Native Forward Scholars Fund, in partnership with the BIE, provides funding specifically for training opportunities in the science, technology, engineering and mathematics (STEM) fields. This is a great opportunity for TCU faculty, staff, and students who are focused in STEM fields to take advantage of this funding. Individuals who are seeking professional development such as continuing education, conferences, training, and certifications can apply for funding to assist with registration, travel, and other related costs. Educators (K-12) at a BIE funded school, a BIE controlled school, a school on a reservation, or a school with a 20% or more Native American population are encouraged to apply.",
      "amount": "Not specified.",
      "deadline": "February 27, 2026, at 11:59 PM MST",
      "eligibility": "Be an enrolled member of a US federally recognized American Indian Tribe or Alaska Native group OR provide documentation of ancestry to possession of 1/2 degree Indian blood of a federally recognized Tribe. Provide proof of Tribal eligibility through submission of a Tribal Eligibility Certificate OR provide proof of Tribal enrollment via a copy of your Certificate Degree of Indian Blood, Tribal membership card, OR a letter of enrollment/descendancy from your Tribal enrollment office. Be employed at a Bureau funded school or similar institutions.",
      "application_url": "https://app.smarterselect.com/programs/105562-Native-Forward-Scholars-Fund",
      "status": "Open"
    },
    {
      "title": "BIE Professional Development Funding for STEM Educators and Students 2025-2026",
      "short_description": "Funding specifically for training opportunities in STEM fields.",
      "full_description": "Native Forward Scholars Fund, in partnership with the BIE, provides funding specifically for training opportunities in the science, technology, engineering and mathematics (STEM) fields. This is a great opportunity for TCU faculty, staff, and students who are focused in STEM fields to take advantage of this funding.",
      "amount": "Varies",
      "deadline": "February 27, 2026",
      "eligibility": "Enrolled member of a US federally recognized American Indian Tribe or Alaska Native group.",
      "application_url": "https://app.smarterselect.com/programs/105562-Native-Forward-Scholars-Fund",
      "status": "Open"
    },
    {
      "title": "BIE Professional Examination Funding 2025-2026",
      "short_description": "Financial assistance to cover professional examination costs.",
      "full_description": "Native Forward Scholars Fund, in partnership with the BIE, provides financial assistance to Fellows to cover the cost of professional examinations, including Bar Examination funding. Exam assistance is limited to a single examination which must be taken within one calendar year after graduation date. This award covers fees incurred to register for the exam, costs of preparatory courses and other exam-related expenses.",
      "amount": "Not specified",
      "deadline": "February 27, 2026, at 11:59 PM MST",
      "eligibility": "Must be currently funded by BIE Scholarship for Service or similar programs; must have graduated within one year of applying; limited to one professional examination.",
      "application_url": "https://app.smarterselect.com/programs/105563-Native-Forward-Scholars-Fund",
      "status": "Open"
    },
    {
      "title": "Miller Indigenous Economic Development Fellowship 2025-2026",
      "short_description": "Through the generous support of Native Forward Alumnus Robert J. Miller...",
      "full_description": "Through the generous support of Native Forward Alumnus Robert J. Miller...",
      "amount": "Not specified",
      "deadline": "February 27, 2026, at 11:59 PM MST",
      "eligibility": "- Be an enrolled member or a descendant of a federally or state-recognized Tribe...",
      "application_url": "https://app.smarterselect.com/programs/105572-Native-Forward-Scholars-Fund",
      "status": "Open"
    },
    {
      "title": "Native Forward Scholars Fund 2026-2027 Scholarship Application",
      "short_description": "This is the application for all Native Forward Scholars Fund scholarship opportunities for the 2026-2027 academic year.",
      "full_description": "By submitting this application, you will be considered for all academic year scholarships that you are eligible for. Throughout our 50-year history, Native Forward Scholars Fund has empowered over 22,000 students from over 500 Tribes in all 50 states by providing scholarship dollars and support services for undergraduate, graduate, and professional degrees.",
      "amount": "Not specified.",
      "deadline": "June 1, 2026, at 11:59 PM MST.",
      "eligibility": "Complete the Free Application for Federal Student Aid (FAFSA); Be a degree-seeking student attending a U.S. accredited institution; Provide a copy of the most recent cumulative academic transcript; Provide a digital photo; Be an enrolled member or descendant of a U.S. federally recognized or state-recognized American Indian Tribe or Alaska Native group; Request a Financial Need Form (FNF) from the institution; Provide contact information for two references; Respond to four applicant questions.",
      "application_url": "https://app.smarterselect.com/programs/101023-Native-Forward-Scholars-Fund",
      "status": "Open."
    },
    {
      "title": "Native Forward Scholars Fund 2026-2027 Scholarship Application",
      "short_description": "This is the application for all Native Forward Scholars Fund scholarship opportunities for the 2026-2027 academic year.",
      "full_description": "This is the application for all Native Forward Scholars Fund scholarship opportunities for the 2026-2027 academic year. By submitting this application, you will be considered for all academic year scholarships that you are eligible for. Throughout our 50-year history, Native Forward Scholars Fund has empowered over 22,000 students from over 500 Tribes in all 50 states by providing scholarship dollars and support services for undergraduate, graduate, and professional degrees.",
      "amount": "Not specified.",
      "deadline": "June 1, 2026, at 11:59 PM MST.",
      "eligibility": "Complete the Free Application for Federal Student Aid (FAFSA). Be a degree-seeking student attending a U.S. accredited institution recognized by the U.S. Secretary of Education or the Council for Higher Education. Provide a copy of their most recent cumulative academic transcript. Provide a digital photo. Be an enrolled member or descendant of a U.S. federally recognized or state-recognized American Indian Tribe or Alaska Native group. Request a Financial Need Form (FNF) from the institution. Provide contact information for two references. Respond to four applicant questions.",
      "application_url": "https://app.smarterselect.com/programs/101023-Native-Forward-Scholars-Fund",
      "status": "Open"
    },
    {
      "title": "Native Forward Scholars Fund Internship Assistance Program 2025-2026",
      "short_description": "Empowering Students Through Experiential Learning: Native Forward Scholars Fund is dedicated to empowering students by providing financial support to access meaningful internship opportunities specifically in non-STEM fields.",
      "full_description": "Empowering Students Through Experiential Learning: Native Forward Scholars Fund is dedicated to empowering students by providing financial support to access meaningful internship opportunities specifically in non-STEM fields. These internships allow students to gain hands-on experience in areas critical to strengthening Tribal communities and fostering leadership development. Expanding Equity and Impact: This program helps students overcome financial barriers that may limit their ability to pursue internships in non-STEM fields such as: Public Policy: Shaping policies to protect Tribal sovereignty and advance Native priorities. Education: Developing culturally relevant learning environments to empower future generations. Social Work: Addressing systemic issues and fostering social equity within Tribal communities. Cultural Preservation: Protecting and promoting the heritage, language, and traditions of Tribal nations. Other non-STEM fields will be considered. These internships are vital for enhancing Tribal communities and advancing social, cultural, and economic well-being. The award provides financial assistance for: Travel Costs: Covers transportation for accepting the internship and daily commuting. Living Expenses: Includes housing and other essential costs during the internship period. Roundtrip Travel: Supports travel to and from the internship location. To ensure transparency and accountability, applicants must submit detailed, itemized documentation of expenses.",
      "amount": "Not specified",
      "deadline": "February 27, 2026, at 11:59 PM MST",
      "eligibility": "To be considered for the Native Forward Internship Funding, the applicant must meet the following requirements: Be an enrolled member or descendant of a US federally or state-recognized Tribe. Provide proof of Tribal enrollment via a copy of their Certificate Degree of Indian Blood, Tribal membership card, OR a letter of enrollment/descendancy from the Tribal enrollment office. Applicants must find their own internship position. The internship must directly align with non-STEM fields such as public policy, education, social work, cultural preservation, etc. Submit a letter confirming acceptance from an internship site. Provide itemized costs/receipts for travel, housing, commuting, etc.",
      "application_url": "https://app.smarterselect.com/programs/105568-Native-Forward-Scholars-Fund",
      "status": "Open"
    },
    {
      "title": "Native Forward Scholars Fund Professional Development Assistance Program 2025-2026",
      "short_description": "Empowering Students Through Experiential Learning: Native Forward Scholars Fund is dedicated to empowering students by providing financial support to access meaningful professional development opportunities specifically in non-STEM fields.",
      "full_description": "Empowering Students Through Experiential Learning: Native Forward Scholars Fund is dedicated to empowering students by providing financial support to access meaningful professional development opportunities specifically in non-STEM fields. These opportunities allow students to gain hands-on experience in areas critical to strengthening Tribal communities and fostering leadership development. Individuals who are seeking professional development such as continuing education, conferences, training, and certifications can apply for funding to assist with registration, travel, and other related costs. Expanding Equity and Impact: This program helps students and educators overcome financial barriers that may limit their ability to pursue professional development in non-STEM fields such as: Public Policy: Shaping policies to protect Tribal sovereignty and advance Native priorities. Education: Developing culturally relevant learning environments to empower future generations. Social Work: Addressing systemic issues and fostering social equity within Tribal communities. Cultural Preservation: Protecting and promoting the heritage, language, and traditions of Tribal nations. Other non-STEM fields will be considered. These opportunities are vital for enhancing Tribal communities and advancing social, cultural, and economic well-being. The award provides financial assistance for: Travel Costs: Covers transportation to and from the professional development opportunity. Lodging Expenses: Includes lodging and other essential costs to attend. Registration: Supports registration costs for the professional development opportunity. To ensure transparency and accountability, applicants must submit detailed, itemized documentation of expenses.",
      "amount": "Not specified",
      "deadline": "February 27, 2026, at 11:59 PM MST",
      "eligibility": "To be considered for the Native Forward Scholars Fund Professional Development Assistance Program, the applicant must meet the following requirements: Be an enrolled member or descendant of a US federally or state-recognized Tribe. Provide proof of Tribal eligibility through submission of a Tribal Eligibility Certificate OR provide proof of Tribal enrollment via a copy of your Certificate Degree of Indian Blood, Tribal membership card, OR a letter of enrollment/descendancy from your Tribal enrollment office. Be attending an accredited post-secondary institution. Applicants must find their own non-STEM professional development opportunity. The opportunity must directly align with non-STEM fields such as public policy, education, social work, cultural preservation etc. Provide itemized costs/receipts for travel, lodging registration etc.",
      "application_url": "mailto:fellowships@NativeForward.org",
      "status": "Open"
    },
    {
      "title": "Native Forward Scholars Fund Professional Development Assistance Program 2025-2026",
      "short_description": "Empowering Students Through Experiential Learning: Native Forward Scholars Fund is dedicated to empowering students by providing financial support to access meaningful professional development opportunities specifically in non-STEM fields.",
      "full_description": "Empowering Students Through Experiential Learning: Native Forward Scholars Fund is dedicated to empowering students by providing financial support to access meaningful professional development opportunities specifically in non-STEM fields. These opportunities allow students to gain hands-on experience in areas critical to strengthening Tribal communities and fostering leadership development.",
      "amount": "Not specified",
      "deadline": "February 27, 2026, at 11:59 PM MST",
      "eligibility": "Be an enrolled member or descendant of a US federally or state-recognized Tribe; provide proof of Tribal eligibility; be attending an accredited post-secondary institution; find their own non-STEM professional development opportunity.",
      "application_url": "mailto:fellowships@NativeForward.org",
      "status": "Open"
    },
    {
      "title": "Miller Indigenous Economic Development Fellowship 2025-2026",
      "short_description": "Through the generous support of Native Forward Alumnus Robert J. Miller...",
      "full_description": "Through the generous support of Native Forward Alumnus Robert J. Miller...",
      "amount": "Not specified",
      "deadline": "February 27, 2026, at 11:59 PM MST",
      "eligibility": "- Be an enrolled member or a descendant of a federally or state-recognized Tribe...",
      "application_url": "https://app.smarterselect.com/programs/105572-Native-Forward-Scholars-Fund",
      "status": "Open"
    }
  ]
}