{
  "title": "Native Forward Scholars Fund Internship Assistance Program 2025-2026",
  "short_description": "Empowering Students Through Experiential Learning: Native Forward Scholars Fund is dedicated to empowering students by providing financial support to access meaningful internship opportunities specifically in non-STEM fields.",
  "full_description": "Empowering Students Through Experiential Learning: Native Forward Scholars Fund is dedicated to empowering students by providing financial support to access meaningful internship opportunities specifically in non-STEM fields. These internships allow students to gain hands-on experience in areas critical to strengthening Tribal communities and fostering leadership development. Expanding Equity and Impact: This program helps students overcome financial barriers that may limit their ability to pursue internships in non-STEM fields such as: Public Policy: Shaping policies to protect Tribal sovereignty and advance Native priorities. Education: Developing culturally relevant learning environments to empower future generations. Social Work: Addressing systemic issues and fostering social equity within Tribal communities. Cultural Preservation: Protecting and promoting the heritage, language, and traditions of Tribal nations. Other non-STEM fields will be considered. These internships are vital for enhancing Tribal communities and advancing social, cultural, and economic well-being. The award provides financial assistance for: Travel Costs: Covers transportation for accepting the internship and daily commuting. Living Expenses: Includes housing and other essential costs during the internship period. Roundtrip Travel: Supports travel to and from the internship location. To ensure transparency and accountability, applicants must submit detailed, itemized documentation of expenses.",
  "amount": "Not specified",
  "deadline": "February 27, 2026, at 11:59 PM MST",
  "eligibility": "To be considered for the Native Forward Internship Funding, the applicant must meet the following requirements: Be an enrolled member or descendant of a US federally or state-recognized Tribe. Provide proof of Tribal enrollment via a copy of their Certificate Degree of Indian Blood, Tribal membership card, OR a letter of enrollment/descendancy from the Tribal enrollment office. Applicants must find their own internship position. The internship must directly align with non-STEM fields such as public policy, education, social work, cultural preservation, etc. Submit a letter confirming acceptance from an internship site. Provide itemized costs/receipts for travel, housing, commuting, etc.",
  "application_url": "https://app.smarterselect.com/programs/105568-Native-Forward-Scholars-Fund",
  "status": "Open"
}