{
  "title": "Native Forward Scholars Fund Professional Development Assistance Program 2025-2026",
  "short_description": "Empowering Students Through Experiential Learning: Native Forward Scholars Fund is dedicated to empowering students by providing financial support to access meaningful professional development opportunities specifically in non-STEM fields.",
  "full_description": "Empowering Students Through Experiential Learning: Native Forward Scholars Fund is dedicated to empowering students by providing financial support to access meaningful professional development opportunities specifically in non-STEM fields. These opportunities allow students to gain hands-on experience in areas critical to strengthening Tribal communities and fostering leadership development. Individuals who are seeking professional development such as continuing education, conferences, training, and certifications can apply for funding to assist with registration, travel, and other related costs. Expanding Equity and Impact: This program helps students and educators overcome financial barriers that may limit their ability to pursue professional development in non-STEM fields such as: Public Policy: Shaping policies to protect Tribal sovereignty and advance Native priorities. Education: Developing culturally relevant learning environments to empower future generations. Social Work: Addressing systemic issues and fostering social equity within Tribal communities. Cultural Preservation: Protecting and promoting the heritage, language, and traditions of Tribal nations. Other non-STEM fields will be considered. These opportunities are vital for enhancing Tribal communities and advancing social, cultural, and economic well-being. The award provides financial assistance for: Travel Costs: Covers transportation to and from the professional development opportunity. Lodging Expenses: Includes lodging and other essential costs to attend. Registration: Supports registration costs for the professional development opportunity. To ensure transparency and accountability, applicants must submit detailed, itemized documentation of expenses.",
  "amount": "Not specified",
  "deadline": "February 27, 2026, at 11:59 PM MST",
  "eligibility": "To be considered for the Native Forward Scholars Fund Professional Development Assistance Program, the applicant must meet the following requirements: Be an enrolled member or descendant of a US federally or state-recognized Tribe. Provide proof of Tribal eligibility through submission of a Tribal Eligibility Certificate OR provide proof of Tribal enrollment via a copy of your Certificate Degree of Indian Blood, Tribal membership card, OR a letter of enrollment/descendancy from your Tribal enrollment office. Be attending an accredited post-secondary institution. Applicants must find their own non-STEM professional development opportunity. The opportunity must directly align with non-STEM fields such as public policy, education, social work, cultural preservation etc. Provide itemized costs/receipts for travel, lodging registration etc.",
  "application_url": "mailto:fellowships@NativeForward.org",
  "status": "Open"
}