
{
  "title": "BIE Internship Funding for STEM Students 2025-2026",
  "short_description": "Funding assistance for internships related to STEM.",
  "full_description": "Native Forward Scholars Fund, in partnership with the BIE, provides financial assistance to students to participate in internships. This financial assistance is established to offset costs directly associated with participation in approved internships with the Department of Interior (Bureau of Indian Affairs, Bureau of Indian Education, Bureau of Land Management, Bureau of Ocean Energy Management, Bureau of Reclamation, Bureau of Safety and Environmental Enforcement, Bureau of Trust Funds Administration, National Park Service, Office of Surface Mining Reclamation and Enforcement, U.S. Fish and Wildlife Service, U.S. Geological Survey, etc.) or other approved internships directly related to STEM. This award covers travel costs, including the cost to travel to accept the internship, eligible living expenses, and daily commuting costs to travel to and from the internship location. Roundtrip travel, housing, and commuting costs will be considered (documentation for itemized costs must be submitted).",
  "amount": "Not specified",
  "deadline": "February 27, 2026 at 11:59 PM MST",
  "eligibility": "Must be an enrolled member of a federally recognized American Indian Tribe or Alaska Native group OR provide documentation of ancestry to possession of 1/2 degree Indian blood of a federally recognized Tribe. Exclusive consideration will be given to students attending a TCU who are participating in internship opportunities offered by Department of Interior (DOI) agencies. STEM related internships with other organizations will also be considered. Students not attending a TCU will also be considered. Internships must be directly related to STEM. Applicants must find their own internship or training position at an eligible DOI or STEM organization. Submit a letter confirming acceptance from an internship site. Submit receipts for expenses incurred.",
  "application_url": "https://app.smarterselect.com/programs/105560-Native-Forward-Scholars-Fund",
  "status": "Open"
}
